[[{"headline": ["'Urgent' call for US drone register - BBC News", "BBC News"]},
{"headline": ["Video games - BBC News", "BBC News"]},
{"headline": ["Intelligent Machines - BBC News", "BBC News"]},
{"headline": ["Could AI shape the future of online call centres? - BBC News", "BBC News"]},
{"headline": ["Being controlled by electric shocks - BBC News", "BBC News"]},
{"headline": ["The machine which can fold your laundry - BBC News", "BBC News"]},
{"headline": ["The cars chasing the Sun - BBC News", "BBC News"]},
{"headline": ["Would you tell Apple when you've had sex? - BBC News", "BBC News"]},
{"headline": ["Could this device transmit touch over long distances? - BBC News", "BBC News"]},
{"headline": ["Robotic Bee copies puffins to fly and swim - BBC News", "BBC News"]},
{"headline": ["Playing table tennis against a robot tutor - BBC News", "BBC News"]},
{"headline": ["DJI Osmo handheld 4K camera films drone-like smooth video - BBC News", "BBC News"]},
{"headline": ["Pay by ring? The tech changing how we make purchases - BBC News", "BBC News"]},
{"headline": ["Flyte lightbulb floats and spins in mid-air - BBC News", "BBC News"]},
{"headline": ["Apple patent case: Wisconsin university wins huge damages - BBC News", "BBC News"]},
{"headline": ["Amazon targets 1,114 'fake reviewers' in Seattle lawsuit - BBC News", "BBC News"]},
{"headline": ["'Whale' finance fraud hits businesses - BBC News", "BBC News"]},
{"headline": ["Faith, hope and Call of Duty: 21st century spirituality - BBC News", "BBC News"]},
{"headline": ["More than 12 million fall into UK digital skills gap - BBC News", "BBC News"]},
{"headline": ["Amazon and NYT: the row continues - BBC News", "BBC News"]},
{"headline": ["Facebook: Irish data watchdog to probe data transfers to US - BBC News", "BBC News"]},
{"headline": ["ISPs asked to block more pirate sites - BBC News", "BBC News"]},
{"headline": ["Scientists create real 'Back To The Future' hoverboard - BBC News", "BBC News"]},
{"headline": ["Back to the Future II: What did it get right and wrong? - BBC News", "BBC News"]},
{"headline": ["Early Apple computer fails to sell - BBC News", "BBC News"]},
{"headline": ["eBay hosts moth-naming auction - BBC News", "BBC News"]},
{"headline": ["Thailand mulls jail term for unlicensed drone pilots - BBC News", "BBC News"]},
{"headline": ["Raging Valley fires could mean swift new drone laws - BBC News", "BBC News"]}]